#### Terraform Plan 📝
```
module.catalog_bastion.data.http.my_ip: Reading...
module.catalog_database.random_password.db_password: Refreshing state... [id=none]
module.catalog_api_gateway.random_password.valid_token: Refreshing state... [id=none]
module.catalog_api_gateway.data.archive_file.lambda_zip: Reading...
module.catalog_eks.data.http.my_ip: Reading...
module.catalog_api_gateway.data.archive_file.lambda_zip: Read complete after 0s [id=cd7b1dab33a483d16323afe7936f681294fbf7f5]
module.catalog_eks.data.http.my_ip: Read complete after 0s [id=https://checkip.amazonaws.com]
module.catalog_bastion.data.http.my_ip: Read complete after 0s [id=https://checkip.amazonaws.com]
module.catalog_eks.data.aws_iam_role.lab_role: Reading...
module.catalog_eks.data.aws_partition.current: Reading...
module.catalog_database.data.aws_iam_role.lab_role: Reading...
module.catalog_eks.data.aws_iam_role.cluster_role: Reading...
module.catalog_api_gateway.data.aws_iam_role.lambda_role: Reading...
module.catalog_eks.data.aws_caller_identity.current: Reading...
module.catalog_eks.data.aws_iam_role.node_role: Reading...
module.catalog_api_gateway.aws_ssm_parameter.valid_token_ssm: Refreshing state... [id=/ordering-system/catalog/apigateway/token]
module.catalog_network.aws_vpc.ordering_vpc: Refreshing state... [id=vpc-05711deb946bf072b]
module.catalog_eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.catalog_eks.data.aws_region.current: Reading...
module.catalog_eks.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.catalog_bastion.aws_key_pair.bastion_key_pair: Refreshing state... [id=catalog_aws_key_pair]
module.catalog_api_gateway.aws_api_gateway_rest_api.api: Refreshing state... [id=xtez1n8r6i]
module.catalog_eks.data.aws_caller_identity.current: Read complete after 0s [id=092649322140]
module.catalog_bastion.data.aws_ami.amazon_linux: Reading...
module.catalog_eks.data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
module.catalog_database.aws_ssm_parameter.shared_database_password: Refreshing state... [id=/ordering-system/catalog/database/password]
module.catalog_eks.data.aws_iam_role.cluster_role: Read complete after 0s [id=c194537a4993920l13518372t1w092649-LabEksClusterRole-YOsRVAob9p16]
module.catalog_bastion.data.aws_iam_role.bastion_role: Reading...
module.catalog_api_gateway.data.aws_iam_role.lambda_role: Read complete after 0s [id=LabRole]
module.catalog_api_gateway.aws_lambda_function.authorizer: Refreshing state... [id=api-authorizer-catalog]
module.catalog_database.data.aws_iam_role.lab_role: Read complete after 0s [id=LabRole]
module.catalog_eks.data.aws_iam_role.node_role: Read complete after 0s [id=LabRole]
module.catalog_bastion.data.aws_iam_role.bastion_role: Read complete after 0s [id=LabRole]
module.catalog_bastion.aws_iam_instance_profile.bastion_profile: Refreshing state... [id=catalog-bastion-profile]
module.catalog_api_gateway.aws_api_gateway_resource.proxy: Refreshing state... [id=2ihe34]
module.catalog_bastion.data.aws_ami.amazon_linux: Read complete after 0s [id=ami-0771b6766e1e61632]
module.catalog_api_gateway.aws_api_gateway_authorizer.lambda_auth: Refreshing state... [id=ps6avr]
module.catalog_api_gateway.aws_lambda_permission.apigw_authorizer_invoke: Refreshing state... [id=AllowAPIGatewayInvokeAuthorizer-catalog]
module.catalog_api_gateway.aws_api_gateway_method.proxy: Refreshing state... [id=agm-xtez1n8r6i-2ihe34-ANY]
module.catalog_network.aws_internet_gateway.ordering_igw: Refreshing state... [id=igw-0e770fb6d9d920318]
module.catalog_network.aws_subnet.ordering_subnet[0]: Refreshing state... [id=subnet-09cd65932a3d9aadb]
module.catalog_eks.aws_security_group.ordering_eks_cluster_sg: Refreshing state... [id=sg-0ccafb033b96fe7dd]
module.catalog_network.aws_subnet.database_subnet[1]: Refreshing state... [id=subnet-0a697f3e6841f9b84]
module.catalog_eks.aws_security_group.ordering_eks_node_sg: Refreshing state... [id=sg-00f69726253b5c5b6]
module.catalog_bastion.aws_security_group.bastion_sg: Refreshing state... [id=sg-022b30273150cf715]
module.catalog_network.aws_subnet.database_subnet[0]: Refreshing state... [id=subnet-0afa6517ab5c9aa5d]
module.catalog_eks.aws_lb_target_group.app_tg: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:092649322140:targetgroup/catalog-tg/1914ca21f5ffa4f1]
module.catalog_eks.aws_security_group.nlb_sg: Refreshing state... [id=sg-00d63e7d3229142b9]
module.catalog_network.aws_subnet.ordering_subnet[1]: Refreshing state... [id=subnet-0dcddb7ae761b27d6]
module.catalog_network.aws_route_table.ordering_route_table: Refreshing state... [id=rtb-0872235ec489e20f5]
module.catalog_network.aws_route_table.ordering_private_route_table: Refreshing state... [id=rtb-0e3bb98fd98090966]
module.catalog_eks.aws_vpc_security_group_egress_rule.eks_node_egress: Refreshing state... [id=sgr-06cd1d22f6cee971d]
module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_node_ingress_self: Refreshing state... [id=sgr-0bb24c83af473a843]
module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_nodes_nodeport_dev[0]: Refreshing state... [id=sgr-0ea2781d425993cfa]
module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_to_node: Refreshing state... [id=sgr-0ca95025cac3dcc86]
module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_node_ingress: Refreshing state... [id=sgr-04e112c4fec8a154a]
module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_dev[0]: Refreshing state... [id=sgr-04995417745320fd2]
module.catalog_eks.aws_vpc_security_group_egress_rule.nlb_egress: Refreshing state... [id=sgr-056390d376b45e510]
module.catalog_eks.aws_vpc_security_group_egress_rule.eks_cluster_egress: Refreshing state... [id=sgr-05b43160b23af7cad]
module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_cluster_from_nodes: Refreshing state... [id=sgr-000345661e8fa4532]
module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_cluster_ingress: Refreshing state... [id=sgr-03eeba59513c95641]
module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_nodes_from_cluster: Refreshing state... [id=sgr-0ba1b305f1f0d562f]
module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_api_deployer: Refreshing state... [id=sgr-0701dcd9cc619ac64]
module.catalog_network.aws_db_subnet_group.ordering_data_subnet_group: Refreshing state... [id=catalog-subnet-group]
module.catalog_network.aws_route_table_association.ordering_route_table_association[1]: Refreshing state... [id=rtbassoc-02b8ab044a790eeaf]
module.catalog_network.aws_route_table_association.ordering_route_table_association[0]: Refreshing state... [id=rtbassoc-0ccdad40e25aa5161]
module.catalog_network.aws_route_table_association.database_route_table_association[1]: Refreshing state... [id=rtbassoc-0ae461998496767d0]
module.catalog_network.aws_route_table_association.database_route_table_association[0]: Refreshing state... [id=rtbassoc-054173acbbbc6d51b]
module.catalog_eks.aws_vpc_security_group_ingress_rule.cluster_bastion_ingress: Refreshing state... [id=sgr-0f92b77f029c3eba0]
module.catalog_eks.aws_vpc_security_group_ingress_rule.node_bastion_ingress: Refreshing state... [id=sgr-092bb8fc9be2c1130]
module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_bastion_ingress: Refreshing state... [id=sgr-0e6613d90b6b2f6ee]
module.catalog_database.aws_security_group.db_sg: Refreshing state... [id=sg-0a74cbd4ef65008c6]
module.catalog_eks.aws_lb.app_nlb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:092649322140:loadbalancer/net/catalog-nlb/58f53ca5e831d863]
module.catalog_bastion.aws_instance.bastion: Refreshing state... [id=i-04ee6ca5d737fbfe0]
module.catalog_eks.aws_eks_cluster.ordering_eks_cluster: Refreshing state... [id=catalog-eks-cluster]
module.catalog_api_gateway.aws_api_gateway_vpc_link.catalog: Refreshing state... [id=2abuhh]
module.catalog_eks.aws_lb_listener.app_listener: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:092649322140:listener/net/catalog-nlb/58f53ca5e831d863/611f0fa72433795f]
module.catalog_api_gateway.aws_api_gateway_integration.proxy: Refreshing state... [id=agi-xtez1n8r6i-2ihe34-ANY]
module.catalog_database.aws_db_instance.ordering_database: Refreshing state... [id=db-JFINJFSAZSVVAESPGGTE77W7XQ]
module.catalog_api_gateway.aws_api_gateway_deployment.api: Refreshing state... [id=9fn2x5]
module.catalog_eks.aws_eks_access_entry.ordering_eks_access_entry_voclabs: Refreshing state... [id=catalog-eks-cluster:arn:aws:iam::092649322140:role/voclabs]
terraform_data.refresh_kubectl: Refreshing state... [id=80092e5b-182a-4144-94e3-74297c0cc9b9]
module.catalog_eks.aws_eks_access_entry.ordering_eks_access_entry: Refreshing state... [id=catalog-eks-cluster:arn:aws:iam::092649322140:role/LabRole]
module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_to_eks_cluster: Refreshing state... [id=sgr-036530d7c50459b5b]
module.catalog_eks.aws_eks_node_group.ordering_eks_node_group: Refreshing state... [id=catalog-eks-cluster:catalog-eks-node-group]
module.catalog_api_gateway.aws_api_gateway_stage.api_stage: Refreshing state... [id=ags-xtez1n8r6i-stage]
module.catalog_database.aws_ssm_parameter.shared_database_host: Refreshing state... [id=/ordering-system/catalog/database/host]
module.catalog_database.aws_ssm_parameter.shared_database_port: Refreshing state... [id=/ordering-system/catalog/database/port]
module.catalog_database.aws_ssm_parameter.shared_database_username: Refreshing state... [id=/ordering-system/catalog/database/username]
module.catalog_database.aws_ssm_parameter.shared_database_name: Refreshing state... [id=/ordering-system/catalog/database/name]
module.catalog_api_gateway.aws_ssm_parameter.api_gateway_url: Refreshing state... [id=/ordering-system/catalog/apigateway/url]
module.catalog_eks.aws_eks_access_policy_association.ordering_eks_access_policy_association: Refreshing state... [id=catalog-eks-cluster#arn:aws:iam::092649322140:role/LabRole#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.catalog_eks.aws_eks_access_policy_association.ordering_eks_access_policy_association_voclabs: Refreshing state... [id=catalog-eks-cluster#arn:aws:iam::092649322140:role/voclabs#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.catalog_k8s.random_password.basic_auth_password: Refreshing state... [id=none]
module.catalog_k8s.aws_ecr_repository_creation_template.dockerhub_template: Refreshing state... [id=dockerhub/catalog]
module.catalog_k8s.kubectl_manifest.database_config: Refreshing state... [id=/api/v1/namespaces/default/configmaps/cfm-database-catalog]
module.catalog_k8s.kubectl_manifest.metrics_config: Refreshing state... [id=/api/v1/namespaces/kube-system/serviceaccounts/metrics-server]
module.catalog_k8s.kubectl_manifest.app_service: Refreshing state... [id=/api/v1/namespaces/default/services/svc-app-lb-catalog]
module.catalog_k8s.helm_release.aws_lb_controller: Refreshing state... [id=aws-load-balancer-controller]
module.catalog_k8s.aws_ssm_parameter.valid_token_ssm: Refreshing state... [id=/ordering-system/catalog/basic_auth/token]
module.catalog_k8s.aws_ecr_pull_through_cache_rule.dockerhub: Refreshing state... [id=dockerhub/catalog]
module.catalog_k8s.terraform_data.ecr_cleanup: Refreshing state... [id=55b71d98-567f-3123-ee6b-a60334c2716d]
module.catalog_k8s.terraform_data.ecr_warmup: Refreshing state... [id=7f74b563-c94e-dd4c-a2ad-a9e9e158403b]
module.catalog_bastion.aws_ssm_parameter.bastion_public_ip: Refreshing state... [id=/ordering-system/catalog/bastion/public_ip]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config                = (known after apply)
      + arn                          = (known after apply)
      + certificate_authority        = (known after apply)
      + cluster_id                   = (known after apply)
      + compute_config               = (known after apply)
      + control_plane_scaling_config = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + enabled_cluster_log_types    = (known after apply)
      + endpoint                     = (known after apply)
      + id                           = (known after apply)
      + identity                     = (known after apply)
      + kubernetes_network_config    = (known after apply)
      + name                         = "catalog-eks-cluster"
      + outpost_config               = (known after apply)
      + platform_version             = (known after apply)
      + region                       = (known after apply)
      + remote_network_config        = (known after apply)
      + role_arn                     = (known after apply)
      + status                       = (known after apply)
      + storage_config               = (known after apply)
      + tags                         = (known after apply)
      + upgrade_policy               = (known after apply)
      + version                      = (known after apply)
      + vpc_config                   = (known after apply)
      + zonal_shift_config           = (known after apply)
    }

  # data.aws_eks_cluster_auth.auth will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster_auth" "auth" {
      + id     = (known after apply)
      + name   = "catalog-eks-cluster"
      + region = (known after apply)
      + token  = (sensitive value)
    }

  # terraform_data.refresh_kubectl must be replaced
-/+ resource "terraform_data" "refresh_kubectl" {
      ~ id               = "80092e5b-182a-4144-94e3-74297c0cc9b9" -> (known after apply)
      ~ output           = {
          - filename = "~/.kube/config"
        } -> (known after apply)
      ~ triggers_replace = "2026-01-19T22:11:26Z" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.catalog_bastion.aws_security_group.bastion_sg will be updated in-place
  ~ resource "aws_security_group" "bastion_sg" {
        id                     = "sg-022b30273150cf715"
      ~ ingress                = [
          - {
              - cidr_blocks      = [
                  - "57.154.172.163/32",
                ]
              - description      = "SSH access from allowed IPs"
              - from_port        = 22
              - ipv6_cidr_blocks = []
              - prefix_list_ids  = []
              - protocol         = "tcp"
              - security_groups  = []
              - self             = false
              - to_port          = 22
            },
          + {
              + cidr_blocks      = [
                  + "172.208.127.243/32",
                ]
              + description      = "SSH access from allowed IPs"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
        name                   = "catalog-bastion-20260119220151815800000004"
        tags                   = {
            "Name"   = "catalog-bastion-sg"
            "origin" = "tc-micro-service-4/modules/bastion/main.tf"
        }
        # (9 unchanged attributes hidden)
    }

  # module.catalog_eks.data.aws_eks_cluster.cluster will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "cluster" {
      + access_config                = (known after apply)
      + arn                          = (known after apply)
      + certificate_authority        = (known after apply)
      + cluster_id                   = (known after apply)
      + compute_config               = (known after apply)
      + control_plane_scaling_config = (known after apply)
      + created_at                   = (known after apply)
      + deletion_protection          = (known after apply)
      + enabled_cluster_log_types    = (known after apply)
      + endpoint                     = (known after apply)
      + id                           = (known after apply)
      + identity                     = (known after apply)
      + kubernetes_network_config    = (known after apply)
      + name                         = "catalog-eks-cluster"
      + outpost_config               = (known after apply)
      + platform_version             = (known after apply)
      + region                       = (known after apply)
      + remote_network_config        = (known after apply)
      + role_arn                     = (known after apply)
      + status                       = (known after apply)
      + storage_config               = (known after apply)
      + tags                         = (known after apply)
      + upgrade_policy               = (known after apply)
      + version                      = (known after apply)
      + vpc_config                   = (known after apply)
      + zonal_shift_config           = (known after apply)
    }

  # module.catalog_eks.aws_eks_cluster.ordering_eks_cluster will be updated in-place
  ~ resource "aws_eks_cluster" "ordering_eks_cluster" {
        id                            = "catalog-eks-cluster"
        name                          = "catalog-eks-cluster"
        tags                          = {
            "origin" = "tc-micro-service-4/modules/eks/main.tf"
        }
        # (14 unchanged attributes hidden)

      ~ vpc_config {
          ~ public_access_cidrs       = [
              - "0.0.0.0/0",
              - "57.154.172.163/32",
              + "172.208.127.243/32",
            ]
            # (6 unchanged attributes hidden)
        }

        # (6 unchanged blocks hidden)
    }

  # module.catalog_eks.aws_ssm_parameter.eks_security_group_id will be created
  + resource "aws_ssm_parameter" "eks_security_group_id" {
      + arn            = (known after apply)
      + data_type      = (known after apply)
      + has_value_wo   = (known after apply)
      + id             = (known after apply)
      + insecure_value = (known after apply)
      + key_id         = (known after apply)
      + name           = "/catalog/eks/security-group-id"
      + region         = "us-east-1"
      + tags           = {
          + "origin"  = "eks-module"
          + "service" = "catalog"
        }
      + tags_all       = {
          + "origin"  = "eks-module"
          + "service" = "catalog"
        }
      + tier           = (known after apply)
      + type           = "String"
      + value          = (sensitive value)
      + value_wo       = (write-only attribute)
      + version        = (known after apply)
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_api_deployer will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "eks_api_deployer" {
      ~ cidr_ipv4              = "57.154.172.163/32" -> "172.208.127.243/32"
        id                     = "sgr-0701dcd9cc619ac64"
        tags                   = {
            "name"   = "catalog-eks-api-deployer"
            "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
        # (8 unchanged attributes hidden)
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.eks_nodes_nodeport_dev[0] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "eks_nodes_nodeport_dev" {
      ~ cidr_ipv4              = "57.154.172.163/32" -> "172.208.127.243/32"
        id                     = "sgr-0ea2781d425993cfa"
        tags                   = {
            "name"   = "catalog-nodeport-dev"
            "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
        # (8 unchanged attributes hidden)
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_dev[0] will be updated in-place
  ~ resource "aws_vpc_security_group_ingress_rule" "nlb_dev" {
      ~ cidr_ipv4              = "57.154.172.163/32" -> "172.208.127.243/32"
        id                     = "sgr-04995417745320fd2"
        tags                   = {
            "name"   = "catalog-nodeport-dev"
            "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
        # (8 unchanged attributes hidden)
    }

  # module.catalog_eks.aws_vpc_security_group_ingress_rule.nlb_to_eks_cluster must be replaced
-/+ resource "aws_vpc_security_group_ingress_rule" "nlb_to_eks_cluster" {
      ~ arn                          = "arn:aws:ec2:us-east-1:092649322140:security-group-rule/sgr-036530d7c50459b5b" -> (known after apply)
      ~ id                           = "sgr-036530d7c50459b5b" -> (known after apply)
      ~ security_group_id            = "sg-042b3f6e8004c8aa3" -> (known after apply) # forces replacement
      ~ security_group_rule_id       = "sgr-036530d7c50459b5b" -> (known after apply)
        tags                         = {
            "name"   = "catalog-nlb-to-eks-cluster"
            "origin" = "tc-micro-service-4/modules/eks/network.tf"
        }
        # (4 unchanged attributes hidden)
    }

  # module.catalog_k8s.data.aws_caller_identity.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_caller_identity" "current" {
      + account_id = (known after apply)
      + arn        = (known after apply)
      + id         = (known after apply)
      + user_id    = (known after apply)
    }

  # module.catalog_k8s.data.aws_ecr_image.service_image will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecr_image" "service_image" {
      + id                  = (known after apply)
      + image_digest        = (known after apply)
      + image_pushed_at     = (known after apply)
      + image_size_in_bytes = (known after apply)
      + image_tag           = "latest"
      + image_tags          = (known after apply)
      + image_uri           = (known after apply)
      + region              = (known after apply)
      + registry_id         = (known after apply)
      + repository_name     = "dockerhub/catalog/jocosta96/catalog-microservice"
    }

  # module.catalog_k8s.data.aws_ecr_image.service_image_by_digest will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecr_image" "service_image_by_digest" {
      + id                  = (known after apply)
      + image_digest        = (known after apply)
      + image_pushed_at     = (known after apply)
      + image_size_in_bytes = (known after apply)
      + image_tags          = (known after apply)
      + image_uri           = (known after apply)
      + region              = (known after apply)
      + registry_id         = (known after apply)
      + repository_name     = "dockerhub/catalog/jocosta96/catalog-microservice"
    }

  # module.catalog_k8s.data.aws_iam_role.lab_role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_role" "lab_role" {
      + arn                  = (known after apply)
      + assume_role_policy   = (known after apply)
      + create_date          = (known after apply)
      + description          = (known after apply)
      + id                   = (known after apply)
      + max_session_duration = (known after apply)
      + name                 = "LabRole"
      + path                 = (known after apply)
      + permissions_boundary = (known after apply)
      + role_last_used       = (known after apply)
      + tags                 = (known after apply)
      + unique_id            = (known after apply)
    }

  # module.catalog_k8s.data.aws_partition.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_partition" "current" {
      + dns_suffix         = (known after apply)
      + id                 = (known after apply)
      + partition          = (known after apply)
      + reverse_dns_prefix = (known after apply)
    }

  # module.catalog_k8s.data.aws_region.current will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_region" "current" {
      + description = (known after apply)
      + endpoint    = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
    }

  # module.catalog_k8s.data.aws_secretsmanager_secret.dockerhub_creds will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_secretsmanager_secret" "dockerhub_creds" {
      + arn               = (known after apply)
      + created_date      = (known after apply)
      + description       = (known after apply)
      + id                = (known after apply)
      + kms_key_id        = (known after apply)
      + last_changed_date = (known after apply)
      + name              = "ecr-pullthroughcache/dockerhub-creds"
      + policy            = (known after apply)
      + region            = (known after apply)
      + tags              = (known after apply)
    }

  # module.catalog_k8s.data.aws_secretsmanager_secret_version.dockerhub_creds_version will be read during apply
  # (config refers to values not yet known)
 <= data "aws_secretsmanager_secret_version" "dockerhub_creds_version" {
      + arn            = (known after apply)
      + created_date   = (known after apply)
      + id             = (known after apply)
      + region         = (known after apply)
      + secret_binary  = (sensitive value)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.catalog_k8s.data.http.metrics_components will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "http" "metrics_components" {
      + body                 = (known after apply)
      + id                   = (known after apply)
      + response_body        = (known after apply)
      + response_body_base64 = (known after apply)
      + response_headers     = (known after apply)
      + status_code          = (known after apply)
      + url                  = "https://github.com/kubernetes-sigs/metrics-server/releases/download/v0.7.2/components.yaml"
    }

  # module.catalog_k8s.aws_ecr_pull_through_cache_rule.dockerhub will be updated in-place
  ~ resource "aws_ecr_pull_through_cache_rule" "dockerhub" {
      ~ credential_arn             = "arn:aws:secretsmanager:us-east-1:092649322140:secret:ecr-pullthroughcache/dockerhub-creds-XDPAXj" -> (known after apply)
        id                         = "dockerhub/catalog"
        # (6 unchanged attributes hidden)
    }

  # module.catalog_k8s.helm_release.aws_lb_controller will be created
  + resource "helm_release" "aws_lb_controller" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = true
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + set                        = [
          + {
              + name  = "clusterName"
              + value = "catalog-eks-cluster"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "region"
              + value = "us-east-1"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "vpcId"
              + value = "vpc-05711deb946bf072b"
                # (1 unchanged attribute hidden)
            },
          + {
              + name  = "serviceAccount.create"
              + value = "true"
                # (1 unchanged attribute hidden)
            },
        ]
      + set_wo                     = (write-only attribute)
      + skip_crds                  = false
      + status                     = "deployed"
      + take_ownership             = false
      + timeout                    = 300
      + upgrade_install            = false
      + verify                     = false
      + version                    = "1.16.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

  # module.catalog_k8s.terraform_data.ecr_cleanup must be replaced
-/+ resource "terraform_data" "ecr_cleanup" {
      ~ id               = "55b71d98-567f-3123-ee6b-a60334c2716d" -> (known after apply)
      ~ output           = {
          - image  = "jocosta96/catalog-microservice"
          - prefix = "dockerhub/catalog"
        } -> (known after apply)
      ~ triggers_replace = "2026-01-19T22:12:44Z" -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # module.catalog_k8s.terraform_data.ecr_warmup must be replaced
-/+ resource "terraform_data" "ecr_warmup" {
      ~ id               = "7f74b563-c94e-dd4c-a2ad-a9e9e158403b" -> (known after apply)
      ~ triggers_replace = "2026-01-19T22:12:45Z" -> (known after apply) # forces replacement
    }

Plan: 6 to add, 6 to change, 4 to destroy.

```

*Pusher: @jocosta96, Action: `pull_request`*